/*
 * wk_distance_MBslave.h
 *
 *  Created on: 27 лист. 2019 р.
 *      Author: KozakVF
 */

#ifndef TK_2_SUBPROJECTS_WK_DISTANCE_MBSLAVE_H_
#define TK_2_SUBPROJECTS_WK_DISTANCE_MBSLAVE_H_


//0х0000 Аварійна дистанційна зупинка ЕД(в будь-якому з дист. режимів роботи)
//0х0001 Встановити режим роботи Дистанційний ручний/Дистанційний автоматичний
//0х0002 Вкл. Автоматичного режиму роботи в режимі дист.авт.
//0х0003 Вкл.ЕД в дистанційному ручному режимі роботи 1- ПУСК 2 - РЕВЕРС 0 - СТОП
//0х0004 Скидання аварії
//0х0005 Скидання аварії 2
//0х0006 Введення паролю 1
//0х0007 Скидання паролю 1/запис на флеш налаштувань 1
//0х0008 Введення паролю 2
//0х0009 Скидання паролю 2 /запис на флеш налаштувань 2
//0х000А Запис на флеш нлаштувань користувача
//0x000B
//0х000С
//0х000D
//0х000Е
//0x000F
//uint16_t uint16_t inDistCmnd = {0};
/* Ця функція обробляє вхідні повідомлення Модбас ТК4
 * та готує відповіді згідно з прикладними алгоритмами Модбас */
void fTK5_Slave1(
		modbus_slave_rx_msg_t *rx,
		modbus_slave_tx_msg_t *tx
		);

#endif /* TK_2_SUBPROJECTS_WK_DISTANCE_MBSLAVE_H_ */
